; domain
(define (domain parking)
 (:requirements :strips :typing  )
 (:types car curb)
 (:predicates 
    (at-curb ?car - car) 
    (at-curb-num ?car - car ?curb - curb)
    (behind-car ?car ?front-car - car)
    (car-clear ?car - car) 
    (curb-clear ?curb - curb)
 )

 

	(:action move-curb-to-curb
		:parameters (?car - car ?curbsrc ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(at-curb-num ?car ?curbsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(curb-clear ?curbsrc)
			(at-curb-num ?car ?curbdest)
			(not (at-curb-num ?car ?curbsrc))
                         
		)
	)

	(:action move-curb-to-car
		:parameters (?car - car ?curbsrc - curb ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(at-curb-num ?car ?curbsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(curb-clear ?curbsrc)
			(behind-car ?car ?cardest)
			(not (at-curb-num ?car ?curbsrc))
			(not (at-curb ?car))
                         
		)
	)

	(:action move-car-to-curb
		:parameters (?car - car ?carsrc - car ?curbdest - curb)
		:precondition (and 
			(car-clear ?car)
			(curb-clear ?curbdest)
			(behind-car ?car ?carsrc)
		)
		:effect (and 
			(not (curb-clear ?curbdest))
			(car-clear ?carsrc)
			(at-curb-num ?car ?curbdest)
			(not (behind-car ?car ?carsrc))
			(at-curb ?car)
                         
		)
	)

	(:action move-car-to-car
		:parameters (?car - car ?carsrc - car ?cardest - car)
		:precondition (and 
			(car-clear ?car)
			(car-clear ?cardest)
			(behind-car ?car ?carsrc)
			(at-curb ?cardest) 
		)
		:effect (and 
			(not (car-clear ?cardest))
			(car-clear ?carsrc)
			(behind-car ?car ?cardest)
			(not (behind-car ?car ?carsrc))
                         
		)
	)
)

; problem
(define   (problem parking)
  (:domain parking)
  (:objects
     car_00  car_01  car_02  car_03  car_04  car_05  car_06  car_07  car_08  car_09  car_10  car_11  car_12  car_13  car_14  car_15  car_16  car_17  car_18  car_19  car_20  car_21  car_22  car_23  car_24  car_25 - car
     curb_00 curb_01 curb_02 curb_03 curb_04 curb_05 curb_06 curb_07 curb_08 curb_09 curb_10 curb_11 curb_12 curb_13 - curb
  )
  (:init
     
    (at-curb car_21)
    (at-curb-num car_21 curb_00)
    (behind-car car_18 car_21)
    (car-clear car_18)
    (at-curb car_17)
    (at-curb-num car_17 curb_01)
    (behind-car car_14 car_17)
    (car-clear car_14)
    (at-curb car_15)
    (at-curb-num car_15 curb_02)
    (behind-car car_03 car_15)
    (car-clear car_03)
    (at-curb car_01)
    (at-curb-num car_01 curb_03)
    (behind-car car_10 car_01)
    (car-clear car_10)
    (at-curb car_11)
    (at-curb-num car_11 curb_04)
    (behind-car car_16 car_11)
    (car-clear car_16)
    (at-curb car_05)
    (at-curb-num car_05 curb_05)
    (behind-car car_19 car_05)
    (car-clear car_19)
    (at-curb car_04)
    (at-curb-num car_04 curb_06)
    (behind-car car_06 car_04)
    (car-clear car_06)
    (at-curb car_00)
    (at-curb-num car_00 curb_07)
    (behind-car car_20 car_00)
    (car-clear car_20)
    (at-curb car_07)
    (at-curb-num car_07 curb_08)
    (behind-car car_23 car_07)
    (car-clear car_23)
    (at-curb car_02)
    (at-curb-num car_02 curb_09)
    (behind-car car_12 car_02)
    (car-clear car_12)
    (at-curb car_09)
    (at-curb-num car_09 curb_10)
    (behind-car car_25 car_09)
    (car-clear car_25)
    (at-curb car_24)
    (at-curb-num car_24 curb_11)
    (behind-car car_22 car_24)
    (car-clear car_22)
    (at-curb car_13)
    (at-curb-num car_13 curb_12)
    (behind-car car_08 car_13)
    (car-clear car_08)
    (curb-clear curb_13)
  )
  (:goal
    (and
      (at-curb-num car_00 curb_00)
      (behind-car car_14 car_00)
      (at-curb-num car_01 curb_01)
      (behind-car car_15 car_01)
      (at-curb-num car_02 curb_02)
      (behind-car car_16 car_02)
      (at-curb-num car_03 curb_03)
      (behind-car car_17 car_03)
      (at-curb-num car_04 curb_04)
      (behind-car car_18 car_04)
      (at-curb-num car_05 curb_05)
      (behind-car car_19 car_05)
      (at-curb-num car_06 curb_06)
      (behind-car car_20 car_06)
      (at-curb-num car_07 curb_07)
      (behind-car car_21 car_07)
      (at-curb-num car_08 curb_08)
      (behind-car car_22 car_08)
      (at-curb-num car_09 curb_09)
      (behind-car car_23 car_09)
      (at-curb-num car_10 curb_10)
      (behind-car car_24 car_10)
      (at-curb-num car_11 curb_11)
      (behind-car car_25 car_11)
      (at-curb-num car_12 curb_12)
      (at-curb-num car_13 curb_13)
    )
  )
 
)
; =========== INIT =========== 
;  curb_00: car_21 car_18 
;  curb_01: car_17 car_14 
;  curb_02: car_15 car_03 
;  curb_03: car_01 car_10 
;  curb_04: car_11 car_16 
;  curb_05: car_05 car_19 
;  curb_06: car_04 car_06 
;  curb_07: car_00 car_20 
;  curb_08: car_07 car_23 
;  curb_09: car_02 car_12 
;  curb_10: car_09 car_25 
;  curb_11: car_24 car_22 
;  curb_12: car_13 car_08 
;  curb_13: 
; ========== /INIT =========== 

; =========== GOAL =========== 
;  curb_00: car_00 car_14 
;  curb_01: car_01 car_15 
;  curb_02: car_02 car_16 
;  curb_03: car_03 car_17 
;  curb_04: car_04 car_18 
;  curb_05: car_05 car_19 
;  curb_06: car_06 car_20 
;  curb_07: car_07 car_21 
;  curb_08: car_08 car_22 
;  curb_09: car_09 car_23 
;  curb_10: car_10 car_24 
;  curb_11: car_11 car_25 
;  curb_12: car_12 
;  curb_13: car_13 
; =========== /GOAL ===========

; plan
1. (move-car-to-curb car_20 car_00 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_20 car_00)
   added: (car-clear car_00) (at-curb-num car_20 curb_13) (at-curb car_20)
   goals met: 2 of 26
2. (move-curb-to-car car_00 curb_07 car_20)
   deleted: (car-clear car_20) (at-curb-num car_00 curb_07) (at-curb car_00)
   added: (curb-clear curb_07) (behind-car car_00 car_20)
   goals met: 2 of 26
3. (move-car-to-curb car_18 car_21 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_18 car_21)
   added: (car-clear car_21) (at-curb-num car_18 curb_07) (at-curb car_18)
   goals met: 2 of 26
4. (move-curb-to-car car_21 curb_00 car_18)
   deleted: (car-clear car_18) (at-curb-num car_21 curb_00) (at-curb car_21)
   added: (curb-clear curb_00) (behind-car car_21 car_18)
   goals met: 2 of 26
5. (move-car-to-curb car_00 car_20 curb_00)
   deleted: (curb-clear curb_00) (behind-car car_00 car_20)
   added: (car-clear car_20) (at-curb-num car_00 curb_00) (at-curb car_00)
   goals met: 3 of 26
6. (move-car-to-car car_14 car_17 car_00)
   deleted: (car-clear car_00) (behind-car car_14 car_17)
   added: (car-clear car_17) (behind-car car_14 car_00)
   goals met: 4 of 26
7. (move-car-to-car car_10 car_01 car_17)
   deleted: (car-clear car_17) (behind-car car_10 car_01)
   added: (car-clear car_01) (behind-car car_10 car_17)
   goals met: 4 of 26
8. (move-curb-to-car car_01 curb_03 car_20)
   deleted: (car-clear car_20) (at-curb-num car_01 curb_03) (at-curb car_01)
   added: (curb-clear curb_03) (behind-car car_01 car_20)
   goals met: 4 of 26
9. (move-car-to-curb car_10 car_17 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_10 car_17)
   added: (car-clear car_17) (at-curb-num car_10 curb_03) (at-curb car_10)
   goals met: 4 of 26
10. (move-curb-to-car car_17 curb_01 car_10)
   deleted: (car-clear car_10) (at-curb-num car_17 curb_01) (at-curb car_17)
   added: (curb-clear curb_01) (behind-car car_17 car_10)
   goals met: 4 of 26
11. (move-car-to-curb car_01 car_20 curb_01)
   deleted: (curb-clear curb_01) (behind-car car_01 car_20)
   added: (car-clear car_20) (at-curb-num car_01 curb_01) (at-curb car_01)
   goals met: 5 of 26
12. (move-car-to-car car_03 car_15 car_20)
   deleted: (car-clear car_20) (behind-car car_03 car_15)
   added: (car-clear car_15) (behind-car car_03 car_20)
   goals met: 5 of 26
13. (move-curb-to-car car_15 curb_02 car_01)
   deleted: (car-clear car_01) (at-curb-num car_15 curb_02) (at-curb car_15)
   added: (curb-clear curb_02) (behind-car car_15 car_01)
   goals met: 6 of 26
14. (move-car-to-curb car_21 car_18 curb_02)
   deleted: (curb-clear curb_02) (behind-car car_21 car_18)
   added: (car-clear car_18) (at-curb-num car_21 curb_02) (at-curb car_21)
   goals met: 6 of 26
15. (move-curb-to-car car_18 curb_07 car_21)
   deleted: (car-clear car_21) (at-curb-num car_18 curb_07) (at-curb car_18)
   added: (curb-clear curb_07) (behind-car car_18 car_21)
   goals met: 6 of 26
16. (move-car-to-curb car_12 car_02 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_12 car_02)
   added: (car-clear car_02) (at-curb-num car_12 curb_07) (at-curb car_12)
   goals met: 6 of 26
17. (move-curb-to-car car_02 curb_09 car_12)
   deleted: (car-clear car_12) (at-curb-num car_02 curb_09) (at-curb car_02)
   added: (curb-clear curb_09) (behind-car car_02 car_12)
   goals met: 6 of 26
18. (move-car-to-curb car_18 car_21 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_18 car_21)
   added: (car-clear car_21) (at-curb-num car_18 curb_09) (at-curb car_18)
   goals met: 6 of 26
19. (move-curb-to-car car_21 curb_02 car_18)
   deleted: (car-clear car_18) (at-curb-num car_21 curb_02) (at-curb car_21)
   added: (curb-clear curb_02) (behind-car car_21 car_18)
   goals met: 6 of 26
20. (move-car-to-curb car_02 car_12 curb_02)
   deleted: (curb-clear curb_02) (behind-car car_02 car_12)
   added: (car-clear car_12) (at-curb-num car_02 curb_02) (at-curb car_02)
   goals met: 7 of 26
21. (move-car-to-car car_16 car_11 car_02)
   deleted: (car-clear car_02) (behind-car car_16 car_11)
   added: (car-clear car_11) (behind-car car_16 car_02)
   goals met: 8 of 26
22. (move-car-to-car car_17 car_10 car_12)
   deleted: (car-clear car_12) (behind-car car_17 car_10)
   added: (car-clear car_10) (behind-car car_17 car_12)
   goals met: 8 of 26
23. (move-curb-to-car car_10 curb_03 car_11)
   deleted: (car-clear car_11) (at-curb-num car_10 curb_03) (at-curb car_10)
   added: (curb-clear curb_03) (behind-car car_10 car_11)
   goals met: 8 of 26
24. (move-car-to-curb car_03 car_20 curb_03)
   deleted: (curb-clear curb_03) (behind-car car_03 car_20)
   added: (car-clear car_20) (at-curb-num car_03 curb_03) (at-curb car_03)
   goals met: 9 of 26
25. (move-car-to-car car_17 car_12 car_03)
   deleted: (car-clear car_03) (behind-car car_17 car_12)
   added: (car-clear car_12) (behind-car car_17 car_03)
   goals met: 10 of 26
26. (move-car-to-car car_06 car_04 car_20)
   deleted: (car-clear car_20) (behind-car car_06 car_04)
   added: (car-clear car_04) (behind-car car_06 car_20)
   goals met: 10 of 26
27. (move-curb-to-car car_04 curb_06 car_12)
   deleted: (car-clear car_12) (at-curb-num car_04 curb_06) (at-curb car_04)
   added: (curb-clear curb_06) (behind-car car_04 car_12)
   goals met: 10 of 26
28. (move-car-to-curb car_10 car_11 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_10 car_11)
   added: (car-clear car_11) (at-curb-num car_10 curb_06) (at-curb car_10)
   goals met: 10 of 26
29. (move-curb-to-car car_11 curb_04 car_10)
   deleted: (car-clear car_10) (at-curb-num car_11 curb_04) (at-curb car_11)
   added: (curb-clear curb_04) (behind-car car_11 car_10)
   goals met: 10 of 26
30. (move-car-to-curb car_04 car_12 curb_04)
   deleted: (curb-clear curb_04) (behind-car car_04 car_12)
   added: (car-clear car_12) (at-curb-num car_04 curb_04) (at-curb car_04)
   goals met: 11 of 26
31. (move-car-to-car car_21 car_18 car_12)
   deleted: (car-clear car_12) (behind-car car_21 car_18)
   added: (car-clear car_18) (behind-car car_21 car_12)
   goals met: 11 of 26
32. (move-curb-to-car car_18 curb_09 car_04)
   deleted: (car-clear car_04) (at-curb-num car_18 curb_09) (at-curb car_18)
   added: (curb-clear curb_09) (behind-car car_18 car_04)
   goals met: 12 of 26
33. (move-car-to-curb car_11 car_10 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_11 car_10)
   added: (car-clear car_10) (at-curb-num car_11 curb_09) (at-curb car_11)
   goals met: 12 of 26
34. (move-curb-to-car car_10 curb_06 car_11)
   deleted: (car-clear car_11) (at-curb-num car_10 curb_06) (at-curb car_10)
   added: (curb-clear curb_06) (behind-car car_10 car_11)
   goals met: 12 of 26
35. (move-car-to-curb car_06 car_20 curb_06)
   deleted: (curb-clear curb_06) (behind-car car_06 car_20)
   added: (car-clear car_20) (at-curb-num car_06 curb_06) (at-curb car_06)
   goals met: 13 of 26
36. (move-curb-to-car car_20 curb_13 car_06)
   deleted: (car-clear car_06) (at-curb-num car_20 curb_13) (at-curb car_20)
   added: (curb-clear curb_13) (behind-car car_20 car_06)
   goals met: 14 of 26
37. (move-car-to-curb car_23 car_07 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_23 car_07)
   added: (car-clear car_07) (at-curb-num car_23 curb_13) (at-curb car_23)
   goals met: 14 of 26
38. (move-curb-to-car car_07 curb_08 car_23)
   deleted: (car-clear car_23) (at-curb-num car_07 curb_08) (at-curb car_07)
   added: (curb-clear curb_08) (behind-car car_07 car_23)
   goals met: 14 of 26
39. (move-car-to-curb car_21 car_12 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_21 car_12)
   added: (car-clear car_12) (at-curb-num car_21 curb_08) (at-curb car_21)
   goals met: 14 of 26
40. (move-curb-to-car car_12 curb_07 car_21)
   deleted: (car-clear car_21) (at-curb-num car_12 curb_07) (at-curb car_12)
   added: (curb-clear curb_07) (behind-car car_12 car_21)
   goals met: 14 of 26
41. (move-car-to-curb car_07 car_23 curb_07)
   deleted: (curb-clear curb_07) (behind-car car_07 car_23)
   added: (car-clear car_23) (at-curb-num car_07 curb_07) (at-curb car_07)
   goals met: 15 of 26
42. (move-car-to-car car_12 car_21 car_23)
   deleted: (car-clear car_23) (behind-car car_12 car_21)
   added: (car-clear car_21) (behind-car car_12 car_23)
   goals met: 15 of 26
43. (move-curb-to-car car_21 curb_08 car_07)
   deleted: (car-clear car_07) (at-curb-num car_21 curb_08) (at-curb car_21)
   added: (curb-clear curb_08) (behind-car car_21 car_07)
   goals met: 16 of 26
44. (move-car-to-curb car_08 car_13 curb_08)
   deleted: (curb-clear curb_08) (behind-car car_08 car_13)
   added: (car-clear car_13) (at-curb-num car_08 curb_08) (at-curb car_08)
   goals met: 17 of 26
45. (move-car-to-car car_22 car_24 car_08)
   deleted: (car-clear car_08) (behind-car car_22 car_24)
   added: (car-clear car_24) (behind-car car_22 car_08)
   goals met: 18 of 26
46. (move-car-to-car car_25 car_09 car_24)
   deleted: (car-clear car_24) (behind-car car_25 car_09)
   added: (car-clear car_09) (behind-car car_25 car_24)
   goals met: 18 of 26
47. (move-curb-to-car car_09 curb_10 car_13)
   deleted: (car-clear car_13) (at-curb-num car_09 curb_10) (at-curb car_09)
   added: (curb-clear curb_10) (behind-car car_09 car_13)
   goals met: 18 of 26
48. (move-car-to-curb car_10 car_11 curb_10)
   deleted: (curb-clear curb_10) (behind-car car_10 car_11)
   added: (car-clear car_11) (at-curb-num car_10 curb_10) (at-curb car_10)
   goals met: 19 of 26
49. (move-curb-to-car car_11 curb_09 car_10)
   deleted: (car-clear car_10) (at-curb-num car_11 curb_09) (at-curb car_11)
   added: (curb-clear curb_09) (behind-car car_11 car_10)
   goals met: 19 of 26
50. (move-car-to-curb car_09 car_13 curb_09)
   deleted: (curb-clear curb_09) (behind-car car_09 car_13)
   added: (car-clear car_13) (at-curb-num car_09 curb_09) (at-curb car_09)
   goals met: 20 of 26
51. (move-car-to-car car_12 car_23 car_13)
   deleted: (car-clear car_13) (behind-car car_12 car_23)
   added: (car-clear car_23) (behind-car car_12 car_13)
   goals met: 20 of 26
52. (move-curb-to-car car_23 curb_13 car_09)
   deleted: (car-clear car_09) (at-curb-num car_23 curb_13) (at-curb car_23)
   added: (curb-clear curb_13) (behind-car car_23 car_09)
   goals met: 21 of 26
53. (move-car-to-curb car_11 car_10 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_11 car_10)
   added: (car-clear car_10) (at-curb-num car_11 curb_13) (at-curb car_11)
   goals met: 21 of 26
54. (move-car-to-car car_25 car_24 car_11)
   deleted: (car-clear car_11) (behind-car car_25 car_24)
   added: (car-clear car_24) (behind-car car_25 car_11)
   goals met: 22 of 26
55. (move-curb-to-car car_24 curb_11 car_10)
   deleted: (car-clear car_10) (at-curb-num car_24 curb_11) (at-curb car_24)
   added: (curb-clear curb_11) (behind-car car_24 car_10)
   goals met: 23 of 26
56. (move-car-to-curb car_12 car_13 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_12 car_13)
   added: (car-clear car_13) (at-curb-num car_12 curb_11) (at-curb car_12)
   goals met: 23 of 26
57. (move-curb-to-car car_13 curb_12 car_12)
   deleted: (car-clear car_12) (at-curb-num car_13 curb_12) (at-curb car_13)
   added: (curb-clear curb_12) (behind-car car_13 car_12)
   goals met: 23 of 26
58. (move-car-to-curb car_25 car_11 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_25 car_11)
   added: (car-clear car_11) (at-curb-num car_25 curb_12) (at-curb car_25)
   goals met: 22 of 26
59. (move-curb-to-car car_11 curb_13 car_25)
   deleted: (car-clear car_25) (at-curb-num car_11 curb_13) (at-curb car_11)
   added: (curb-clear curb_13) (behind-car car_11 car_25)
   goals met: 22 of 26
60. (move-car-to-curb car_13 car_12 curb_13)
   deleted: (curb-clear curb_13) (behind-car car_13 car_12)
   added: (car-clear car_12) (at-curb-num car_13 curb_13) (at-curb car_13)
   goals met: 23 of 26
61. (move-curb-to-car car_12 curb_11 car_13)
   deleted: (car-clear car_13) (at-curb-num car_12 curb_11) (at-curb car_12)
   added: (curb-clear curb_11) (behind-car car_12 car_13)
   goals met: 23 of 26
62. (move-car-to-curb car_11 car_25 curb_11)
   deleted: (curb-clear curb_11) (behind-car car_11 car_25)
   added: (car-clear car_25) (at-curb-num car_11 curb_11) (at-curb car_11)
   goals met: 24 of 26
63. (move-curb-to-car car_25 curb_12 car_11)
   deleted: (car-clear car_11) (at-curb-num car_25 curb_12) (at-curb car_25)
   added: (curb-clear curb_12) (behind-car car_25 car_11)
   goals met: 25 of 26
64. (move-car-to-curb car_12 car_13 curb_12)
   deleted: (curb-clear curb_12) (behind-car car_12 car_13)
   added: (car-clear car_13) (at-curb-num car_12 curb_12) (at-curb car_12)
   goals met: 26 of 26
